{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "c56b0df4",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "\n",
    "#Прочитайте файл 2017_jun_final.csv с помощью метода read_csv\n",
    "df = pd.read_csv('2017_jun_final.csv')\n",
    "\n",
    "#Прочитайте полученную таблицу используя метод head\n",
    "#print(df.head())\n",
    "\n",
    "#Определите размер таблицы с помощью метода shape\n",
    "#print(df.shape)\n",
    "\n",
    "#Определите типы всех столбцов с помощью dataframe.dtypes\n",
    "#print(df.dtypes)\n",
    "\n",
    "#Посчитайте, какая доля пропусков содержится в каждой колонке (используйте методы isnull и sum)\n",
    "columns = list(df.columns)\n",
    "for col in columns:\n",
    "    sum_nan = 0\n",
    "    for i in df[col].isnull():\n",
    "        if i:\n",
    "            sum_nan += 1\n",
    "    #print(f'{col} NaN percentage: {sum_nan*100/df[col].shape[0]}')\n",
    "    \n",
    "#Удалите все столбцы с пропусками, кроме столбца \"Язык.программирования\"\n",
    "for col in columns:\n",
    "    sum_nan = 0\n",
    "    for i in df[col].isnull():\n",
    "        if i:\n",
    "            sum_nan += 1\n",
    "    if col != 'Язык.программирования' and sum_nan:\n",
    "        df.drop([col], axis = 1, inplace = True)\n",
    "        \n",
    "#Опять посчитайте, какая доля пропусков содержится в каждой колонке и убедитесь, что остался только столбец \"Язык.программирования\"\n",
    "columns = list(df.columns)\n",
    "for col in columns:\n",
    "    sum_nan = 0\n",
    "    for i in df[col].isnull():\n",
    "        if i:\n",
    "            sum_nan += 1\n",
    "    #print(f'{col} NaN percentage: {sum_nan*100/df[col].shape[0]}')\n",
    "    \n",
    "#Удалите все строки в исходной таблице с помощью метода dropna\n",
    "df = df.dropna()\n",
    "\n",
    "#Определите новый размер таблицы с помощью метода shape\n",
    "#print(df.shape)\n",
    "\n",
    "#Создайте новую таблицу python_data в которой будут только строки со специалистами указавшими язык программирования Python\n",
    "python_data = pd.read_csv('2017_jun_final.csv')\n",
    "python_data = python_data[python_data['Язык.программирования'] == 'Python']\n",
    "\n",
    "#Определите размер таблицы python_data с помощью метода shape\n",
    "#print(python_data.shape)\n",
    "\n",
    "#Используя метод groupby выполните группировку по столбцу \"Должность\"\n",
    "python_data.groupby('Должность')\n",
    "\n",
    "#Создайте новый DataFrame, где для сгруппированных данных по столбцу \"Должность\", выполните агрегацию данных с помощью метода agg и найдите минимальное и максимальное значение в столбце \"Зарплата.в.месяц\"\n",
    "zp_data = python_data.groupby('Должность')['Зарплата.в.месяц'].agg(['min', 'max'])\n",
    "\n",
    "#Создайте функцию fill_avg_salary которая будет возвращать среднее значение заработной платы в месяц. Используйте ее для метода apply и создайте новый столбик \"avg\"\n",
    "def fill_avg_salary(df):\n",
    "    return (df['min'] + df['max'])/2\n",
    "\n",
    "avg = zp_data.apply(fill_avg_salary, axis = 1)\n",
    "zp_data['avg'] = avg\n",
    "\n",
    "#Создайте описательную статистику с помощью метода describe для нового столбца.\n",
    "zp_data['avg'].describe()\n",
    "\n",
    "#Сохраните полученную таблицу в CSV файл\n",
    "zp_data.to_csv('hw2.csv')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
